
// Ввести целое число n и вывести 2 в степени n ,используя битовые операции
std::cout << "Input the number: \n"; 
	int x;
	std::cin >> x;
	std::cout << ((1 << x));
	return 0;
  
  
 // Вывести двоичное представление целого положительного числа, используябитовые операции
